Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 128)               100480    
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 129       
=================================================================
Total params: 100,609
Trainable params: 129
Non-trainable params: 100,480
_________________________________________________________________